anki-deck-production.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-10-24 Mon 15:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>anki deck production</title>
<meta name="author" content="yefeiyu" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="/favicon.ico">
<meta name="theme-color" content="#ffffff">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/style/toc.css"/>
<link rel="stylesheet" href="/style/tufte.css"/>
<link rel="stylesheet" href="/style/main.css"/>
<link rel="alternate" type="application/rss+xml" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

<link rel="stylesheet" href="/style/copy-pre.css"/>
<link rel="stylesheet" href="/style/clipboard.css">
<link rel="stylesheet" href="/style/custom.css">
<link rel="stylesheet" href="/style/clip2.css"/>
<button class="button" id="copy-button" data-clipboard-target="#code">Copy</button>
</head>
<body>
<div id="preamble" class="status">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-NJRFJGX"
                  height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header>
    <a accesskey="h" href="/index.html"> HOME </a> |
    <a href="#" id="edit-in-github">EDIT</a> |
    <a href="https://yefeiyu.github.io/index.xml">RSS</a> |
    <a accesskey="H" href="/about.html">ABOUT</a> |
    <a href="https://github.com/yefeiyu">GITHUB</a>
</header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">anki deck production</h1>
</header>

<div id="outline-container-org3131c7f" class="outline-2">
<h2 id="org3131c7f"><span class="section-number-2">1.</span> Download *.mkv film or U.S.drama</h2>
</div>
<div id="outline-container-orgd310ae7" class="outline-2">
<h2 id="orgd310ae7"><span class="section-number-2">2.</span> MKVExtractGUI2</h2>
<div class="outline-text-2" id="text-2">
<p>
a. Download mkvtoolnix-20-0-0-64-bit, the latest version is 23rd, what we need is 20th here.
Installed 
b. Download MKVExtractGUI2, the latest version is 2.4.0.0, what we need is 1.6.4.1 here.
put MKVExtractGUI2 into mkvtoolnix's installation folder.
c. Use MKVExtractGUI2 to seperate *.mkv into video, music, and subtitle files.
d. Use mkvtoolnix to combine video and music files into a new *.mkv file.
</p>
</div>
</div>
<div id="outline-container-orgaa464de" class="outline-2">
<h2 id="orgaa464de"><span class="section-number-2">3.</span> Use SrtEdit to convert subtitle file and adjust the timeline.</h2>
</div>
<div id="outline-container-org49234aa" class="outline-2">
<h2 id="org49234aa"><span class="section-number-2">4.</span> aboboo</h2>
<div class="outline-text-2" id="text-4">
<p>
a. Add *mkv file, load subtitles, remove short sentence. Save original and translated subtitles in *srt UTF-8 format seperately.
b. (You can also make aboboo mobile courseware.[1])
</p>
</div>
</div>
<div id="outline-container-orgb3503d1" class="outline-2">
<h2 id="orgb3503d1"><span class="section-number-2">5.</span> subs2srs</h2>
<div class="outline-text-2" id="text-5">
<p>
a. Subs1, Original subtitle; Subs2, translated; Check the Normalize Audio box; modify Generalte Audio Clips into 320, modify Generate Snapshots and Video Clips into best quality; modify Bitrates into 3200 and 320 kb/s; Name of deck as XX.S01, and E01 is defined by First Episode. Now you can preview it.
b. The generated files is in the Output folder. The *.mp3.
</p>
</div>
</div>
<div id="outline-container-org8fc8aa1" class="outline-2">
<h2 id="org8fc8aa1"><span class="section-number-2">6.</span> anki</h2>
<div class="outline-text-2" id="text-6">
<p>
a. First, you need modify the **.S01.tsv‘s contents,remove the first <code>Tab</code> symbol for each line.
b. Open anki, <code>Import File</code>
c. Type is subs2srs, Deck is U.S.drama::[Yours deck's name]::espode number, and <code>Import</code> it.
</p>
</div>
</div>
<div id="outline-container-org2b0796a" class="outline-2">
<h2 id="org2b0796a"><span class="section-number-2">7.</span> ASChange</h2>
<div class="outline-text-2" id="text-7">
<p>
a. add all mp3 files, select all, hit <code>Convert</code>
b. <code>Format</code> tag, Max. Quality; <code>Extras</code> tag, Don't check <code>Normalize volume</code> box, if you had adjusted th volume by check the <code>Normalize Audio</code> option in <code>subs2srs</code>.
</p>

<p>
[1] I'll write a other tutorial.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <p>Author: yefeiyu <a aria-label="Follow @yefeiyu on GitHub" data-count-aria-label="# followers on GitHub" data-count-api="/users/jcouyang#followers" data-count-href="/jcouyang/followers" href="https://github.com/yefeiyu class="github-button">Follow @yefeiyu</a></p>
  <p>Modified: 2022-10-22 Sat 16:50</p>
  <p>Generated by: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.3) &#215; <a href="https://github.com/jcouyang/orgpress">OrgPress</a></p>
</footer>
</div>
</body>
</html>
